app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
          <td><%= song.title %></td>
          <td><%= song.track_users.where(id: @user.id).count %></td>