app/views/singles/index.html.erb

          <td><a href="/singles/<%=song.id%>"><u><%= song.title %> </u></a></td>
          <td><%= song.tracks.count %> </td>
---
SELECT COUNT(*) FROM "tracks" WHERE "tracks"."single_id" = ?  [["single_id", 1]]