app/views/singles/show.html.erb

          <td><a href="/users/<%= u.id %>"><u><%= u.first_name %> <%= u.last_name%></u></a></td>
          <td><%= u.single_tracks.where(id: @single.id).count %></td>
---
SELECT  "singles".* FROM "singles" WHERE "singles"."id" = ? LIMIT 1  [["id", 1]]