app/controllers/tracks_controller.rb

   def create
    single = Single.find(params[:song_id])
    @track = Track.create(user: current_user, single: single)
---
SELECT  "singles".* FROM "singles" WHERE "singles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tracks" ("user_id", "single_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["single_id", 1], ["created_at", "2016-10-29 18:15:30.198875"], ["updated_at", "2016-10-29 18:15:30.198875"]]