app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @current_user = current_user
    @user = User.find(params[:id])
    @songs = @user.single_tracks.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "singles".* FROM "singles" INNER JOIN "tracks" ON "singles"."id" = "tracks"."single_id" WHERE "tracks"."user_id" = ?  [["user_id", 5]]